MikroElektronika/core_packages/ARM/gcc_clang/def/nxp/MCXC141VFM/mcu.h
#define OVF_ERROR_EN                  0x00000010      // Determines whether OVF_ERROR condition signal is used in generation of USB_CLK_RECOVERY_INT.;; 0: The interrupt will be masked;; 1: The interrupt will be enabled.


//*****************************************************************************
//
// The following are defines for the bit fields in the USBx_CLK_RECOVER_INT_STATUS register.
//
//*****************************************************************************

#define OVF_ERROR                     0x00000010      // Write operation with value high at 1'b1 on any combination of individual bits will clear those bits.


//*****************************************************************************
//
// The following are defines for the bit fields in the MTB_POSITION register.
//
//*****************************************************************************

#define Trace Packet Address Pointer[28:0]0xFFFFFFF80000000      // POINTER
#define WRAP                          0x00000004      // WRAP


//*****************************************************************************
//
// The following are defines for the bit fields in the MTB_MASTER register.
//
//*****************************************************************************

#define Main Trace Enable             0x80000000      // EN
#define Halt Request                  0x00000200      // HALTREQ
#define RAM Privilege                 0x00000100      // RAMPRIV
#define Special Function Register Write Privilege0x00000080      // SFRWPRIV
#define Trace Stop Input Enable       0x00000040      // TSTOPEN
#define Trace Start Input Enable      0x00000020      // TSTARTEN
#define Mask                          0x000001F0      // MASK


//*****************************************************************************
//
// The following are defines for the bit fields in the MTB_FLOW register.
//
//*****************************************************************************

#define WATERMARK[28:0]               0xFFFFFFF80000000      // WATERMARK
#define AUTOHALT                      0x00000002      // AUTOHALT
#define AUTOSTOP                      0x00000001      // AUTOSTOP


//*****************************************************************************
//
// The following are defines for the bit fields in the MTB_BASE register.
//
//*****************************************************************************

#define BASEADDR                      0x7FFFFFFF80000000      // This value is defined with a hardwired signal and the expression: 0x2000_0000 - (RAM_Size/4). For example, if the total RAM capacity is 16 KB, this field is 0x1FFF_F000.


//*****************************************************************************
//
// The following are defines for the bit fields in the MTB_AUTHSTAT register.
//
//*****************************************************************************

#define BIT3-BIT2                     0x00000018      // BIT3-BIT2


//*****************************************************************************
//
// The following are defines for the bit fields in the MTBDWT_CTRL register.
//
//*****************************************************************************

#define Number of comparators         0x780000000      // NUMCMP
#define DWT configuration controls    0x18000000      // DWTCFGCTRL


//*****************************************************************************
//
// The following are defines for the bit fields in the MTBDWT_COMPn register.
//
//*****************************************************************************

#define Reference value for comparison0x7FFFFFFF80000000      // COMP


//*****************************************************************************
//
// The following are defines for the bit fields in the MTBDWT_MASKn register.
//
//*****************************************************************************

#define This field is reserved.;; MASK0x3FFFFFF80000000      // MASK


//*****************************************************************************
//
// The following are defines for the bit fields in the MTBDWT_FCT0 register.
//
//*****************************************************************************

#define Comparator match              0x01000000      // MATCHED
#define Data Value Address 0          0x00078000      // DATAVADDR0
#define Data Value Size               0x00001800      // DATAVSIZE
#define Data Value Match              0x00000100      // DATAVMATCH
#define Function                      0x000001F0      // FUNCTION


//*****************************************************************************
//
// The following are defines for the bit fields in the MTBDWT_FCT1 register.
//
//*****************************************************************************

#define Comparator match              0x01000000      // MATCHED
#define Function                      0x000001F0      // FUNCTION


//*****************************************************************************
//
// The following are defines for the bit fields in the MTBDWT_TBCTRL register.
//
//*****************************************************************************

#define Number of Comparators         0x780000000      // NUMCOMP
#define Action based on Comparator 1 match0x00000002      // ACOMP1
#define Action based on Comparator 0 match0x00000001      // ACOMP0


//*****************************************************************************
//
// The following are defines for the bit fields in the ROM_ENTRYn register.
//
//*****************************************************************************

#define ENTRY                         0x7FFFFFFF80000000      // ENTRY


//*****************************************************************************
//
// The following are defines for the bit fields in the ROM_TABLEMARK register.
//
//*****************************************************************************

#define MARK                          0x7FFFFFFF80000000      // MARK


//*****************************************************************************
//
// The following are defines for the bit fields in the ROM_SYSACCESS register.
//
//*****************************************************************************

#define SYSACCESS                     0x7FFFFFFF80000000      // SYSACCESS
#define -                             0x3FFFFFFF80000000      // -
#define SYSACCESS                     0x00000001      // SYSACCESS


//*****************************************************************************
//
// The following are defines for the bit fields in the ROM_PERIPHIDn register.
//
//*****************************************************************************

#define PERIPHID                      0x7FFFFFFF80000000      // PERIPHID


//*****************************************************************************
//
// The following are defines for the bit fields in the ROM_COMPIDn register.
//
//*****************************************************************************

#define COMPID                        0x7FFFFFFF80000000      // Component ID



#endif // __MCXC141VFM_H__

